Database 1/DB1-Learning/db1-orm/app/controllers/matches_controller.rb

  def create
    @match = Match.new(match_params)
    @match.end_time = @match.start_time + 1.hour
    if @match.save
---
INSERT INTO "matches" ("start_time", "end_time", "created_at", "updated_at", "question_pool_id", "rounds_count") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def show
    @match = Match.find(params[:id])
    render json: {
      match_id: @match.id,
      question_pool_id: @match.question_pool_id,
      start_time: @match.start_time,
      end_time: @match.end_time,
      rounds_count: @match.rounds_count,
      players_count: @match.players.count,
      players: @match.players.as_json(only: [:id, :name, :score]),
      questions: adjusted_questions(@match.questions)
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
SELECT "players".* FROM "players" INNER JOIN "player_matches" ON "players"."id" = "player_matches"."player_id" WHERE "player_matches"."match_id" = $1  [["match_id", 29]]
SELECT "questions".* FROM "questions" INNER JOIN "matches_questions" ON "questions"."id" = "matches_questions"."question_id" WHERE "matches_questions"."match_id" = $1  [["match_id", 29]]
SELECT COUNT(*) FROM "players" INNER JOIN "player_matches" ON "players"."id" = "player_matches"."player_id" WHERE "player_matches"."match_id" = $1  [["match_id", 29]]

  def leaderboard
    @match = Match.find(params[:id])
    @leaderboard = @match.players.order(score: :desc)
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
SELECT "players".* FROM "players" INNER JOIN "player_matches" ON "players"."id" = "player_matches"."player_id" WHERE "player_matches"."match_id" = $1 ORDER BY "players"."score" DESC  [["match_id", 31]]