Database 1/DB1-Learning/db1-orm/app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("text", "correct_answer", "difficulty_level", "question_pool_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"