Database 1/DB1-Learning/db1-orm/app/controllers/question_pools_controller.rb

SELECT "question_pools".* FROM "question_pools"
---
  def index
    @question_pools = QuestionPool.all

SELECT "question_pools".* FROM "question_pools" WHERE "question_pools"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
---
  def show
    @question_pool = QuestionPool.find(params[:id])

INSERT INTO "question_pools" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Geography"], ["description", "Questions about geography"], ["created_at", "2025-01-06 21:12:13.428593"], ["updated_at", "2025-01-06 21:12:13.428593"]]
---
  def create
    @question_pool = QuestionPool.new(question_pool_params)
    if @question_pool.save